{
  "https://www.google.com/maps/place/Los+Banos+Roofing/@37.038167,-121.0964149,9z/data=!4m18!1m9!3m8!1s0x4078801c78be5211:0x7bbc0a06be3c50d8!2sLos+Banos+Roofing!8m2!3d37.038167!4d-121.096415!9m1!1b1!16s%2Fg%2F11l1w6tr_d!3m7!1s0x4078801c78be5211:0x7bbc0a06be3c50d8!8m2!3d37.038167!4d-121.096415!9m1!1b1!16s%2Fg%2F11l1w6tr_d?hl=en-IN&entry=ttu&g_ep=EgoyMDI1MDYxMS4wIKXMDSoASAFQAw%3D%3D": {
    "data": {
      "reviews": [
        {
          "author_name": "Cindy Wilde5 reviews",
          "rating": 5,
          "text": "Los Banos Roofing did some emergency work for me during a storm and my experience with them was exceptional. They came out promptly, did a thorough evaluation of all of the problems they observed on my roof not just the current leak, but problems that had clearly been there for years that other roofers missed. They gave me an estimate, which felt very reasonable to me considering how much I have paid in the past for roof repairs. They scheduled the work, arrived on time, performed the work without fail, and took pictures of all of the work before and after to confirm that the work had been done. They then followed up with me a week later during another storm to confirm that they had indeed successfully repaired my roof. I have been searching for years for a responsive and ethical roofing company and I feel so grateful to have found Los Banos Roofing. I will call them in a heartbeat the next time I have roofing issues.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV-c99GPUaU6oK7BVtNnc1XqSS2oCtVbEhLPTzohMzb6HQz3Og9=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Ricky S2 reviews · 3 photos",
          "rating": 5,
          "text": "Recently, I discovered a leak in my roof beneath the solar panels, caused by a cracked tile due to subpar work by the solar company. I hired Los Banos Roofing to address the issue. They replaced the damaged tile and added new waterproof underlayment across the entire area where the solar panels are located. I’m thrilled with the quality of their work, and the price was very fair.\n\nIsis and Juan were a pleasure to deal with. Juan and his team worked quickly and efficiently, wasting no time. After the job was done, Isis followed up with a call to ensure we had no concerns or questions.\n\nI wholeheartedly recommend Los Banos Roofing!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIjEo9weB1aVGYof3C6Hei8PeR57FTxmnAvAYpzqP_GfFRhgg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Daniel Sorenson3 reviews · 4 photos",
          "rating": 5,
          "text": "Everything about our experience with Los Banos was great. They were friendly, accommodating, and we couldn’t be happier with our new roof!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5cY1EzZlh8fy4TMovuR42T41AeRibBPErENCBzJclN-oahs8w=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Ludwig Knoester5 reviews",
          "rating": 5,
          "text": "Los banos roofing did a fantastic job repairing my backyard patio roof. They are professional,  highly skilled, hard workers. They even made sure the surrounding roof tiles are free from leaks and rotted underlying felt and put back the fragile tiles in place. Thank you los banos roofing.  I highly recommend this company AND they are Chamber of Commerce members!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCxGT87-1XC6i5Y7OZh1-NFJYJ22PZeGxk6nM4R2bzjb9f_g=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Rayray sp2 reviews · 2 photos",
          "rating": 5,
          "text": "Support local businesses that are reliable, do quality work with a reasonable price i  Waited a couple of months to make the review just to make sure that my roof is 100% overall i recommend this company",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX8zW15x3lNTusu7dfbeZRHLJXfkXNNJbKo8E9hTMmkpRTdi55W=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Bart Beltran1 review",
          "rating": 5,
          "text": "Losbanos roofing did a fantastic job on tile roof and gutter install., Juan came to Madera and gave me a quote on the day he promised. They also worked around a tight schedule I had and went above and beyond  to complete job. Will be only roofing company I will use",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWjs97yAcvaWb3MK_ieHI7COXO1hQFFjI9uLY6Bq1x_YV80cD0=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Paul Leal1 review",
          "rating": 5,
          "text": "Great company run by great people. We’ve done three jobs with Los Banos Roofing now and all have gone flawlessly. Their prices are fair and I highly recommended them.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKIzpvkIjDFHr4SgmnV5y0f2RfO8XORsWd4mjUlTsm_eTtBQQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Ronald Souza3 reviews",
          "rating": 5,
          "text": "Called a few companies over some concerns about roof on our house. Isis was the only one that promptly replied and followed up on calls. She and Juan came to house and inspected roof. Much to my surprise Juan said roof was actually in pretty good shape and just needed some maintenance. Scheduled the maintenance with them and even has them change roof on our shed. They scheduled work within a week and kept me posted frequently. Work done was superb, timely and very clean. Can’t say I felt uneasy about anything in whole process. Isis and Juan do a great job. Money well spent and wouldn’t hesitate to use again.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLPeX-Tx9nNlY_yEeDgguvPcWHJ533iNfJOdaJaQDdM_xVFbw=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Tom Shitanishi7 reviews",
          "rating": 5,
          "text": "Took a chance because they are rather new to Los Banos but I always like to give a new business a chance because that how I got my start—-well they did not disappoint—— they were prompt, fixed my damaged wood and did a wonderful job in installing my new singles —-also they clean the area very thoroughly —-I will use them again",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI1HUeGsCDm8ZcJ2taLXucgo31SHDE5KcdwwW7kuoMa7lG0yA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Enrique Martinez Moreno1 review",
          "rating": 5,
          "text": "I had a roofing job that they handled and they did an awesome job! They were super detailing as well as professional, I would recommend them 100%. I would definitely hire them again!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ4ojE6_LZl0_hMcAyqnlrMdJYc2Tn8RQ9diZJAPqF_s8RBHQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Ronnie Vieira1 review",
          "rating": 5,
          "text": "Awesome job!!! I will call them for any future roofing needs.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUWV6qGe3Umo0s3N_OwMk29315XBf5oAjQlG7U4fU9RBazS9wB2=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Lora McdonnellLocal Guide · 45 reviews · 4 photos",
          "rating": 5,
          "text": "Great job! Very professional and done on time. Love my new roof!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXkUJl7p9Pw2Md8lOtbeK55BzwO0FkSqXKjB7KoOFaJI2oIx1TV=w36-h36-p-rp-mo-ba3-br100"
        },
        {
          "author_name": "Pablo leal3 reviews",
          "rating": 5,
          "text": "Excellent service and quality and professionals",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUL4VSSP_PK3uETIZesauVlHxXxrH9UXpruUTkyGMVA1oqZ020=w36-h36-p-rp-mo-br100"
        }
      ],
      "rating": 5,
      "user_ratings_total": 13
    },
    "timestamp": 1749954947062
  },
  "https://www.google.com/maps/place/Joes+Gutters+%26+Patios,+L.L.C/@29.6421305,-90.1589495,9z/data=!4m8!3m7!1s0x862099bf193270df:0x7141b8ae4640789d!8m2!3d29.8982159!4d-90.0429827!9m1!1b1!16s%2Fg%2F11g49qz1fb?hl=en&entry=ttu&g_ep=EgoyMDI1MDYxMS4wIKXMDSoASAFQAw%3D%3D": {
    "data": {
      "reviews": [
        {
          "author_name": "Joshua Clement2 reviews · 1 photo",
          "rating": 5,
          "text": "Very pleased and impressed with Joe's. Great price to go along with first class work! Will definitely use them again and recommend them to everyone! The crew that did the work was awesome!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJd6MpMSG9_nEW9wl_5kVGQgHceE4gBCn6n8OEAPaCxXLtLYg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Jorge OsorioLocal Guide · 9 reviews · 12 photos",
          "rating": 5,
          "text": "I knew from the very beginning that my experience with Joes Gutters was going to be a good one. On install day they showed up with everything ready to go. The staff was professional and polite. I am very happy with my new patio. At the end of the install they cleanup well and left everything as it was but now with a beautiful patio. I highly recommend Joes Gutters & Patios. Thank you for the great work.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKTUDS2Tzr3EW2zeqqws95IL8-EEnFkXnDCbBfFZOnL9PVPrQ=w36-h36-p-rp-mo-ba2-br100"
        },
        {
          "author_name": "George ChiosLocal Guide · 20 reviews · 7 photos",
          "rating": 5,
          "text": "Professional, punctual, and genuine. The father and son duo provide exceptional quality gutters at competitive pricing. Mr. Joe  was very friendly, personable, and re-assured me of any uneasiness I had about the process. Definitely the best in the city !",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUkebQ3ro-ErwI9VZIJG3MAstyh1muDVC1uMf2RKinHNfhtlyU=w36-h36-p-rp-mo-ba2-br100"
        },
        {
          "author_name": "Inez Dogu10 reviews · 2 photos",
          "rating": 5,
          "text": "Joe's patios and gutters did a wonderful job with my patio.  They came on time, they were professional and thorough, they knew exactly what I needed.  I would definitely  recommend them.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKqsizNIHwDNVayty6m1KZ28xb7xFbWZTNW11uQUD_Oib20MA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Mark Oquinn2 reviews · 6 photos",
          "rating": 5,
          "text": "Good people, easy to deal with, answered all my questions and done a heck of job installing my gutters. And looks AMAZING…..",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXGro1-qt_bUhNLLgDE4r9eqZTYQ9SBe_wpGeGzBzYpUziWy45n=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Ivan BaptistaLocal Guide · 16 reviews · 10 photos",
          "rating": 5,
          "text": "Excellent experience, estimate delivered in a timely manner and detailed. Other companies we got quotes from just gave us a price with no details on materials or how the work would be performed. Joe's professional staff got our patio built quickly with great attention to detail. Highly recommend Joe's Gutter and Patios.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2fIr90HikmwYJqs4b_EJYFZjrWXwLssrWDJ2iWl1ueLq9Vg=w36-h36-p-rp-mo-ba2-br100"
        },
        {
          "author_name": "Neil McCarthy (megsdad1)21 reviews · 4 photos",
          "rating": 5,
          "text": "They responded quickly to my request for gutters and came and did the install within a few days. Very easy to work with",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU7mOzmJKkV8pxzASexBAxSQtPto_XE9LGuzdnr0FXMRVo1-M4=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Marc Calilan11 reviews",
          "rating": 5,
          "text": "Joe’s Gutters & Patios did an absolutely fantastic job installing my screen room patio. Derel and his crew were extremely professional, efficient, and detail-oriented from start to finish. They showed up on time, worked diligently, and made sure everything was completed to perfection. The quality of their workmanship is top-notch. My wife and I couldn’t be happier with the result and highly recommend them to anyone looking for expert patio or gutter installation. Looking back, I’m grateful we chose them for this project and will consider them for any future work they can do!!!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUWdtgBtqxZAfSiX0BaG4XE0E3xLOKTGjlO2pv4o7wKhLbl89Lr=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Kim Rauch2 reviews · 3 photos",
          "rating": 5,
          "text": "The crew at Joes Gutter & Patios were very professional, polite, and on time with appointment. They took care when taking down old gutter and replacing it with the new one.  We love the look of the new gutter. Would definitely recommend them.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJP0LnNCC_3OXnNT6p3HCgQev2-Jzpx7djwvzAeKE_FZnAs4g=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Nick Fuglaar5 reviews · 1 photo",
          "rating": 5,
          "text": "Joe’s gutters were great! They provided an estimate quickly, had a great price, were professional, and were available 2 days after I accepted the estimate to install my gutters. The gutters came out great. Would definitely use them again! Just FYI, we chose musket brown color, see image.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLZ2v4qXcWOsr9_2-n6oyPGy8mhoLWccGPpWlsfXXBFWTD9qQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "djt3145 reviews · 1 photo",
          "rating": 5,
          "text": "Courteous and professional throughout the process from initial contact to installation.\nHigh quality work, neat and clean. Arrived on time. All workers respected our property. Very satisfied.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLl3u2LQ1N1cw_TwQT7aht19UhSRbN7sxLizXEF3UBJxwG0vQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Silvia Popova4 reviews · 6 photos",
          "rating": 5,
          "text": "Excellent job! Very quick and easy process from choosing colors to finishing product and installation. Exceptional customer service and reasonable pricing. Would definitely recommend Joe’s gutters.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKsNaNQ9I_DT3V4URCWAKYnsEICVGzaxzRHDFZnV8OzwO-EcQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Catrina Smith3 reviews · 3 photos",
          "rating": 5,
          "text": "Very professional. Very fast with great quality work. I will definitely use him for future projects .",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsFdC9F7aEwfbihkTsJo71fT7yPw74RV2fdVLj0ThjbJv6VA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "micah bailey2 reviews",
          "rating": 5,
          "text": "Joe’s Gutters, & Patios did a wonderful job, I am a very pleased customer. Prices was very reasonable, and workers were very professional. I highly recommend their services.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXTwG3GnzeaHoEjTAgb36cfIqkK819c0tWL0eTgI0zbhSoWJCuf=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Eugene Netter8 reviews",
          "rating": 5,
          "text": "The 3 man crew arrived early and got to work right away. They were polite, professional and handled the parts and material with care.\nEverything went well and I was very impressed with the finished product. The carport was very reasonable ,i got what I  paid for ,and now I can enjoy it.    Thank you Joe's Gutters & Patios !",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLQlW_I_xmauevI8C82bdnOg49BpF6enEZVWE7oQWC99FDUhw=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "phoebe zervigon11 reviews · 1 photo",
          "rating": 5,
          "text": "My experience with Joes was amazing from start to finish. They reached out to give me a quote the day after I submitted my request and got me a quote the same day they visited. Once we signed the contract work started a couple of days later and they installed my awning in just a few hours. I highly recommend them!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLsXNPyObfquU9NzH8uks1jp9tLyaTu_3jMi2ybOiEOeWBVrw=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Braia Blanchard1 review · 2 photos",
          "rating": 5,
          "text": "Love the way they came out. Color matches perfectly with our garage and shutters. This company was very professional and communicated well with everything. Highly recommend them!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLH9Ghv934MREr6dMuPWRhTwcnmLMxbBJdzfbmyXA-b64Hf5g=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Ismael Lara2 reviews · 5 photos",
          "rating": 5,
          "text": "Joe's Gutters and Patio truly exceeded our expectations with their seamless gutter installation. The level of professionalism displayed by their team was remarkable. From start to finish, they showcased expertise and efficiency, leaving us impressed. The quality of workmanship is evident in the seamless gutters they installed, not to mention the competitive pricing that made the entire experience even more satisfying. Highly recommended for anyone seeking top-notch service and exceptional results.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ9ElBT0D7eyD7oOqvd8PH1Sd8UlBHRPNpmoPlE-T4aCsaxZA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Kiara Ray2 reviews",
          "rating": 5,
          "text": "Joes Gutters assisted me with tear down or my old patio and putting up a new one. They were speedy, efficient, and very knowledgeable on what I was looking for. They answered all of my questions that I had and started the work quicker than I could have expected. Everyone I interacted with was very kind and responding quickly. Overall, I would also recommend this company to anyone looking to have their patio done.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJNZW3zBrInFwRLsKqF64xKEYBbhYABtUurc8q6cuh5vkn9DA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Aaron Haydel1 review · 1 photo",
          "rating": 5,
          "text": "The crew arrived on time.  The work was professionally done.   The crew cleaned up behind themselves and hauled away the old gutters.  Job well done.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1pWIVY7XwIzhHOrUZbAlbz-yjD96TrT_TZcE-y1m_4lLt7A=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "hieu nguyen2 reviews",
          "rating": 5,
          "text": "I am so impressed with how attention to detail and thorough Joe’s gutters was.  Special thanks to Derel, Jonathan and their group for going above and beyond by fixing and repairing sections of my roof that they weren’t obligated to do.  Derel was very professional and answered all my questions in a very timely matter.  The service after the service was next level.  I truly recommend Joe’s Gutter and Patio to anyone looking for gutters, roofing, or patio services!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI7Fb-mM2sGprCgu_uaGctT17hZw1vWVn0SZgYgT0YOkA3KMw=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Lester Osorio3 reviews · 2 photos",
          "rating": 5,
          "text": "Immaculate work! Highly recommended! Completed the gutters and a back yard patio before the afternoon was up!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7nFiZk8rmqOW0iiHUVQW3ZKr7tAm8Ef9xPlSUzN3hd3y3qA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Carlos Lopez1 review",
          "rating": 5,
          "text": "The team was very professional with their work,we loved the gutters & patio cover. will recommend them to our\nFriends..\nThank you Joe's Gutters.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVlpj9TBPQN_M4Ii-640g1DeUUh3SMYA7ODiSx_ZNVnvRhlAUb8=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Michelle Armbruster4 reviews",
          "rating": 5,
          "text": "Derel was very helpful in explaining everything that needed to be done along the way.  The communication between Derel, the crew and myself was outstanding.  They were on time, completed work on schedule and everything was cleaned up and left as it was before the job.  I would definitely recommend Joe’s for anyone looking to replace their gutter system.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIfyNxoKPPbOo7GR7fLTuQXUiOv1br34NEVF2gQNY8HhzRO4g=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Cortney Collo10 reviews · 6 photos",
          "rating": 5,
          "text": "We had a great experience with Joe and his staff! Everything was completed promptly and professionally. His installers showed up first thing, and worked very hard to finish the project within a few hours. Pricing was fair. I would highly recommend this company!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIv7xPxk6Dc_Mre7On5Cl3ajD9TLfSpQSPOZ5TrfWTNpoX4zTk=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Angelle Cresswell7 reviews · 4 photos",
          "rating": 5,
          "text": "Joe and his team came out and installed my gutters and leaf guards in one day. The gutters truly transformed my house. I absolutely love the quality as well as the look. Landon was very knowledgeable and professional, and the team took their time answering all of my questions! Joe's Gutters exceeded my expectations! Would highly recommend!!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVx3st_inhvczOYWtywmI8DXhXbU0JwBAoPA2rhi-f4O2WO35hdoQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Kyle Carver11 reviews",
          "rating": 5,
          "text": "Derel with Joe's Gutters was more than helpful in the process of repairing my gutters. He listened to my concerns, explained the process and executed my vision. The efficient communication and timely turn around is what makes this company top notch over others. I will recommend to friends and colleagues.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWEdBm_I4qNrUvHEyQ5JP0ge6-eLJZ6uWlg_yutF6b_yiee2hfL=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "K B3 reviews · 4 photos",
          "rating": 5,
          "text": "Incredible job! I love my beautiful new gutters! Super fast service and very easy to communicate with.  The BOSS was actually on the job site as well.  Great company! Would hire again!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKqEvJIsqjY-_6ENVZujXjfbpdbOU03r6b71sgTKvMlKwFusA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Vinh LamLocal Guide · 25 reviews",
          "rating": 5,
          "text": "Derel was extremely communicative and helpful during the planning and schedule process! Landon and Diego did a great job install the gutters! Additionally, they made sure to spend the extra time to clean up afterwards.\n\nI would definitely Joes Gutters if anyone was needing gutters.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7pYZrv3mhgfQ4oGqRTqnvcQNIBh6OSpU12dP-hHBrmjb7YHLTIw=w36-h36-p-rp-mo-ba2-br100"
        },
        {
          "author_name": "Sabrina Hernandez4 reviews",
          "rating": 5,
          "text": "Derel and the team are great. He came out to price the job quickly, and completed the service even faster! They cleaned up and did everything they said they would in no time. Derel even came to my house on a Saturday so we could see color samples, overall great experience and have already referred several family members. Thanks for everything!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUoW9WAvbtXBJHbylXxULCS1KpOruEwxy_lcQqdvrpkU-IQ0UJP=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "NIKI DITCHARO1 review · 3 photos",
          "rating": 5,
          "text": "Awesome job. Friendly customer service. 10/10 recommend",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5hicpVId-_kXL670PcEXKB9pVQfZgPhkfsHb8VUsiMv84DBU=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Jacob Porche7 reviews",
          "rating": 5,
          "text": "A ton of color choices, extremely professional, quick scheduling, and the install was definitely faster than I expected it to be. Overall the gutters came out great and we are very happy with our investment.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKeAcc7AIb9uR0WrUDGPAAJcAc6tH4VVzJ8gSQwOXhfuTjbWg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Daniel Vichot2 reviews · 3 photos",
          "rating": 5,
          "text": "Derel and his crew at Joe’s did a wonderful job repairing my home after we had tornado damage. They installed a new roof, new gutters, new fence, exterior painting and even took care of minor repairs that I could find noone else to do. They were professional and hard-working. They were prompt and reliable. Derel was regularly on site supervising and we were always in communication via text. It was a refreshing experience to work with Derel and Joe’s Gutters. Highly recommend!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbjYEpNcrrjvMPc2umGZZ7VHDCas5bS6W1zWqM8DPPQYCJfA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Andrea Dantin2 reviews · 2 photos",
          "rating": 5,
          "text": "Would give them more stars if I could !!  From start to finish of the process of installing all new gutters and patio they were amazing . Mr Joe and Deryl are always available and with quick response time . Installers were respectful and work spaces left immaculate when finished . I will be recommending them to everyone !!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIbFyMBv5RPY1EFjwDrUTt_poe9RByHuPzJR2g4j1mbgQtqrA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Matthew Melder3 reviews · 1 photo",
          "rating": 5,
          "text": "They did a great job! Exceeded our expectations, super fast and installed nicely and clean, while being affordable. We also love the color. It enhanced the exterior of our home. Definitely recommend. 10/10!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJZWzkhRTtK0x8iqdfzGcejHVi22T_6NZYfPhfTxhkf6ewMxCg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Miriam Crespo5 reviews · 2 photos",
          "rating": 5,
          "text": "Working with Joe’s made everything so easy. They were very responsive. I have a busy work schedule and they worked with me to get the job done. They did it earlier than anticipated. They left everything clean, worked in timely, manner and it looks great. I look forward to sitting out there and enjoying my patio.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJm1e8hd_H6YJUHWCXyskVxsO-9WVEI5KOD3iYLFKPJTE0U8A=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Robbie7 reviews · 1 photo",
          "rating": 5,
          "text": "Professionals  through out the entire job from estimate to completion of work.Prompt communications, Quality work.Dwayne and Landon were available to answer any questions. Thanks.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLYLbApvTstYxvTk8e6zS5q-Xs6xWBqZqxdfF8dNY4O3qQ8wA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Eric Butler3 reviews · 1 photo",
          "rating": 5,
          "text": "Joe's Gutters & Patios exceeded my expectations with their quality work and affordable pricing. Derel and his crew were fantastic to work with - professional, courteous, and highly skilled. They installed a screened-in patio at my home, and the result is nothing short of outstanding.  The attention to detail and craftsmanship are evident in every aspect of the construction. From my initial consultation with Joe to the final touches, the team was communicative, efficient, and dedicated to delivering the best possible project.  Highly recommend Joe's Patios & Gutters for anyone looking to enhance their outdoor space with top-notch work!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocILTcr7aj4Veesy8pQaUKdDc4TWuIqM_H_-EnoF2sGj2_7wwQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Carolyn Coffey4 reviews",
          "rating": 5,
          "text": "I am very happy with Joe's Gutters. They did just what we discussed and left everything neat and clean. After the rain, the usually muddy areas were dry thanks to the well installed gutters and downspouts. I recommend Joe's Gutters & Patios. Thank you.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRBvePfpgQw7_pWiL__P5F55PO3OALrqEzh60Wwx4snEqsww=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Lorna Bettisworth4 reviews · 1 photo",
          "rating": 5,
          "text": "Joe's Gutters and Patios did a wonderful job with putting up a new patio covering for us.   They were really quick too... less than 3 hours and they had it all done and cleaned up very well afterwards too.   I would highly recommend them.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJon-SdQ4nUQwdJFW7wiC7jDWnRVg1G64--H9dPSfgSZ9YNYQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Derris Armstead6 reviews · 2 photos",
          "rating": 5,
          "text": "Joes Gutters & Patios did an exceptional job on our home. I was very pleased with their professionalism and speed with the completion of the job. I definitely recommend them for anyone who is looking to get their gutters done.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1Dke2hP5Qz-5fUFP-ZQI2IIJedfZrDMJcJtZeXXGYO2tYIQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Georgette Laviolette2 reviews",
          "rating": 5,
          "text": "Mr.Joe came out to give us a estimate on a new patio cover.  I tell you,  he is so knowledgeable! That only comes with years of experience!! He didn't try to sell me something we didn't want and explained the whole process. The installation was efficient, they were done within a few hours! The price was much lower then the competitors. Thank you Mr.Joe !!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLUrijbupAAnDc9-GW_hgKleFZZTfyi9kDh3-xeewTugcQO1A=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "John Holwell4 reviews",
          "rating": 5,
          "text": "Excellent service.  Needed ~70 feet of gutters replaced after a wind storm.  The crew worked well together and quickly installed the gutters and four downspouts.\n\nWould highly recommended.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2v4IayQVTeaPloAlJ_Tc3vbgNbaNitvp72YjAkF4XieXtaw=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Yvonne Leger1 review",
          "rating": 5,
          "text": "The crew showed up on time and finished installing our patio cover quickly. Everyone was very professional. All of my questions were answered. Very pleased.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK9A-Uopk5xQ3WU-q9Ng2KkBLgDkPOad5sNsbzde8ioFJLmvQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Denise J. Spencer5 reviews",
          "rating": 5,
          "text": "Excellent Service, courteous, friendly, professional, and helpful and resonable price. My experience was pleasant from beginning to end. I definitely highly recommend this company.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXXLRt6RT5hIuP5dhDfsGoRRCr4DFjRdu99kjxZHd0QA_R7L7cgA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Truong Nguyen9 reviews · 4 photos",
          "rating": 5,
          "text": "Joes Gutters & Patios,L.L.C is the best decision I ever made.. they are family own local to new orleans. Very Professional. Service was beyond my expectation!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVLuj9EvUm_4HXMkuAIWmRiv9sCBBG3L1SGYkdw-xVIFpzwXg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Adriel Folse3 reviews",
          "rating": 5,
          "text": "Great people to get the job done and very quick. My gutters and patio look great. I recommend them to everyone. They did a great job!!!!❤️",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9BXYBywHCXWZjfeBgaxV5_R-peQtuskQJbB3m6wRQeFYl0Co=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Robert Hallas1 review",
          "rating": 5,
          "text": "Gutter had had pulled away from fascia. Old Ida damage. Guy did fine job, gutter is straight and drained well during a short afternoon thunderstorm.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLF6mdBRLRCWYWMHyf6QNyZGLje_2zqg6maRtJzWDbxSH6xSg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Chanda Guchereau10 reviews · 2 photos",
          "rating": 5,
          "text": "I instant message Joe, he replied quickly He came to my house that afternoon got a quote this was a Friday. Monday morning he let me know they would be here for Tuesday 8am. They guys came replaced 8 panels and the front panel (pretty piece)\nOther companies wanted to replace the whole thing 52' long even the company that installed patio. Others wanted too much to fix it, but Joe's gutters & patios good price and fast service!! I would use them again!!\nHappy Customer\nChanda Guchereau\nKenner",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLu2CUIIMu_GLmvx4XsW-_bY_VshvGxYuAkJrZoS44uApd17g=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Jerry Potts11 reviews · 1 photo",
          "rating": 5,
          "text": "Competitive pricing, quality products and quality installation.  A bi plus, they did not keep finding \"other issues\" to address after their estimate.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIMAHsacyZ-lAP-N_124XgwRcn1FF-mTiFcGXsVB32O_1YOLQ=w36-h36-p-rp-mo-br100"
        }
      ],
      "rating": 5,
      "user_ratings_total": 215
    },
    "timestamp": 1749970783244
  },
  "https://www.google.com/maps/place/Joes+Gutters+%26+Patios,+L.L.C/@29.6421305,-90.1589495,9z/data=!4m18!1m9!3m8!1s0x862099bf193270df:0x7141b8ae4640789d!2sJoes+Gutters+%26+Patios,+L.L.C!8m2!3d29.8982159!4d-90.0429827!9m1!1b1!16s%2Fg%2F11g49qz1fb!3m7!1s0x862099bf193270df:0x7141b8ae4640789d!8m2!3d29.8982159!4d-90.0429827!9m1!1b1!16s%2Fg%2F11g49qz1fb?hl=en&entry=ttu&g_ep=EgoyMDI1MDYxMS4wIKXMDSoASAFQAw%3D%3D": {
    "data": {
      "reviews": [
        {
          "author_name": "Joshua Clement2 reviews · 1 photo",
          "rating": 5,
          "text": "Very pleased and impressed with Joe's. Great price to go along with first class work! Will definitely use them again and recommend them to everyone! The crew that did the work was awesome!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJd6MpMSG9_nEW9wl_5kVGQgHceE4gBCn6n8OEAPaCxXLtLYg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Jorge OsorioLocal Guide · 9 reviews · 12 photos",
          "rating": 5,
          "text": "I knew from the very beginning that my experience with Joes Gutters was going to be a good one. On install day they showed up with everything ready to go. The staff was professional and polite. I am very happy with my new patio. At the end of the install they cleanup well and left everything as it was but now with a beautiful patio. I highly recommend Joes Gutters & Patios. Thank you for the great work.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKTUDS2Tzr3EW2zeqqws95IL8-EEnFkXnDCbBfFZOnL9PVPrQ=w36-h36-p-rp-mo-ba2-br100"
        },
        {
          "author_name": "George ChiosLocal Guide · 20 reviews · 7 photos",
          "rating": 5,
          "text": "Professional, punctual, and genuine. The father and son duo provide exceptional quality gutters at competitive pricing. Mr. Joe  was very friendly, personable, and re-assured me of any uneasiness I had about the process. Definitely the best in the city !",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUkebQ3ro-ErwI9VZIJG3MAstyh1muDVC1uMf2RKinHNfhtlyU=w36-h36-p-rp-mo-ba2-br100"
        },
        {
          "author_name": "Inez Dogu10 reviews · 2 photos",
          "rating": 5,
          "text": "Joe's patios and gutters did a wonderful job with my patio.  They came on time, they were professional and thorough, they knew exactly what I needed.  I would definitely  recommend them.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKqsizNIHwDNVayty6m1KZ28xb7xFbWZTNW11uQUD_Oib20MA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Mark Oquinn2 reviews · 6 photos",
          "rating": 5,
          "text": "Good people, easy to deal with, answered all my questions and done a heck of job installing my gutters. And looks AMAZING…..",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXGro1-qt_bUhNLLgDE4r9eqZTYQ9SBe_wpGeGzBzYpUziWy45n=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Ivan BaptistaLocal Guide · 16 reviews · 10 photos",
          "rating": 5,
          "text": "Excellent experience, estimate delivered in a timely manner and detailed. Other companies we got quotes from just gave us a price with no details on materials or how the work would be performed. Joe's professional staff got our patio built quickly with great attention to detail. Highly recommend Joe's Gutter and Patios.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2fIr90HikmwYJqs4b_EJYFZjrWXwLssrWDJ2iWl1ueLq9Vg=w36-h36-p-rp-mo-ba2-br100"
        },
        {
          "author_name": "Neil McCarthy (megsdad1)21 reviews · 4 photos",
          "rating": 5,
          "text": "They responded quickly to my request for gutters and came and did the install within a few days. Very easy to work with",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU7mOzmJKkV8pxzASexBAxSQtPto_XE9LGuzdnr0FXMRVo1-M4=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Marc Calilan11 reviews",
          "rating": 5,
          "text": "Joe’s Gutters & Patios did an absolutely fantastic job installing my screen room patio. Derel and his crew were extremely professional, efficient, and detail-oriented from start to finish. They showed up on time, worked diligently, and made sure everything was completed to perfection. The quality of their workmanship is top-notch. My wife and I couldn’t be happier with the result and highly recommend them to anyone looking for expert patio or gutter installation. Looking back, I’m grateful we chose them for this project and will consider them for any future work they can do!!!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUWdtgBtqxZAfSiX0BaG4XE0E3xLOKTGjlO2pv4o7wKhLbl89Lr=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Kim Rauch2 reviews · 3 photos",
          "rating": 5,
          "text": "The crew at Joes Gutter & Patios were very professional, polite, and on time with appointment. They took care when taking down old gutter and replacing it with the new one.  We love the look of the new gutter. Would definitely recommend them.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJP0LnNCC_3OXnNT6p3HCgQev2-Jzpx7djwvzAeKE_FZnAs4g=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Nick Fuglaar5 reviews · 1 photo",
          "rating": 5,
          "text": "Joe’s gutters were great! They provided an estimate quickly, had a great price, were professional, and were available 2 days after I accepted the estimate to install my gutters. The gutters came out great. Would definitely use them again! Just FYI, we chose musket brown color, see image.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLZ2v4qXcWOsr9_2-n6oyPGy8mhoLWccGPpWlsfXXBFWTD9qQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "djt3145 reviews · 1 photo",
          "rating": 5,
          "text": "Courteous and professional throughout the process from initial contact to installation.\nHigh quality work, neat and clean. Arrived on time. All workers respected our property. Very satisfied.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLl3u2LQ1N1cw_TwQT7aht19UhSRbN7sxLizXEF3UBJxwG0vQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Silvia Popova4 reviews · 6 photos",
          "rating": 5,
          "text": "Excellent job! Very quick and easy process from choosing colors to finishing product and installation. Exceptional customer service and reasonable pricing. Would definitely recommend Joe’s gutters.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKsNaNQ9I_DT3V4URCWAKYnsEICVGzaxzRHDFZnV8OzwO-EcQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Catrina Smith3 reviews · 3 photos",
          "rating": 5,
          "text": "Very professional. Very fast with great quality work. I will definitely use him for future projects .",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsFdC9F7aEwfbihkTsJo71fT7yPw74RV2fdVLj0ThjbJv6VA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "micah bailey2 reviews",
          "rating": 5,
          "text": "Joe’s Gutters, & Patios did a wonderful job, I am a very pleased customer. Prices was very reasonable, and workers were very professional. I highly recommend their services.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXTwG3GnzeaHoEjTAgb36cfIqkK819c0tWL0eTgI0zbhSoWJCuf=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Eugene Netter8 reviews",
          "rating": 5,
          "text": "The 3 man crew arrived early and got to work right away. They were polite, professional and handled the parts and material with care.\nEverything went well and I was very impressed with the finished product. The carport was very reasonable ,i got what I  paid for ,and now I can enjoy it.    Thank you Joe's Gutters & Patios !",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLQlW_I_xmauevI8C82bdnOg49BpF6enEZVWE7oQWC99FDUhw=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "phoebe zervigon11 reviews · 1 photo",
          "rating": 5,
          "text": "My experience with Joes was amazing from start to finish. They reached out to give me a quote the day after I submitted my request and got me a quote the same day they visited. Once we signed the contract work started a couple of days later and they installed my awning in just a few hours. I highly recommend them!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLsXNPyObfquU9NzH8uks1jp9tLyaTu_3jMi2ybOiEOeWBVrw=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Braia Blanchard1 review · 2 photos",
          "rating": 5,
          "text": "Love the way they came out. Color matches perfectly with our garage and shutters. This company was very professional and communicated well with everything. Highly recommend them!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLH9Ghv934MREr6dMuPWRhTwcnmLMxbBJdzfbmyXA-b64Hf5g=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Ismael Lara2 reviews · 5 photos",
          "rating": 5,
          "text": "Joe's Gutters and Patio truly exceeded our expectations with their seamless gutter installation. The level of professionalism displayed by their team was remarkable. From start to finish, they showcased expertise and efficiency, leaving us impressed. The quality of workmanship is evident in the seamless gutters they installed, not to mention the competitive pricing that made the entire experience even more satisfying. Highly recommended for anyone seeking top-notch service and exceptional results.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ9ElBT0D7eyD7oOqvd8PH1Sd8UlBHRPNpmoPlE-T4aCsaxZA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Kiara Ray2 reviews",
          "rating": 5,
          "text": "Joes Gutters assisted me with tear down or my old patio and putting up a new one. They were speedy, efficient, and very knowledgeable on what I was looking for. They answered all of my questions that I had and started the work quicker than I could have expected. Everyone I interacted with was very kind and responding quickly. Overall, I would also recommend this company to anyone looking to have their patio done.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJNZW3zBrInFwRLsKqF64xKEYBbhYABtUurc8q6cuh5vkn9DA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Aaron Haydel1 review · 1 photo",
          "rating": 5,
          "text": "The crew arrived on time.  The work was professionally done.   The crew cleaned up behind themselves and hauled away the old gutters.  Job well done.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1pWIVY7XwIzhHOrUZbAlbz-yjD96TrT_TZcE-y1m_4lLt7A=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "hieu nguyen2 reviews",
          "rating": 5,
          "text": "I am so impressed with how attention to detail and thorough Joe’s gutters was.  Special thanks to Derel, Jonathan and their group for going above and beyond by fixing and repairing sections of my roof that they weren’t obligated to do.  Derel was very professional and answered all my questions in a very timely matter.  The service after the service was next level.  I truly recommend Joe’s Gutter and Patio to anyone looking for gutters, roofing, or patio services!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI7Fb-mM2sGprCgu_uaGctT17hZw1vWVn0SZgYgT0YOkA3KMw=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Lester Osorio3 reviews · 2 photos",
          "rating": 5,
          "text": "Immaculate work! Highly recommended! Completed the gutters and a back yard patio before the afternoon was up!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7nFiZk8rmqOW0iiHUVQW3ZKr7tAm8Ef9xPlSUzN3hd3y3qA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Carlos Lopez1 review",
          "rating": 5,
          "text": "The team was very professional with their work,we loved the gutters & patio cover. will recommend them to our\nFriends..\nThank you Joe's Gutters.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVlpj9TBPQN_M4Ii-640g1DeUUh3SMYA7ODiSx_ZNVnvRhlAUb8=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Michelle Armbruster4 reviews",
          "rating": 5,
          "text": "Derel was very helpful in explaining everything that needed to be done along the way.  The communication between Derel, the crew and myself was outstanding.  They were on time, completed work on schedule and everything was cleaned up and left as it was before the job.  I would definitely recommend Joe’s for anyone looking to replace their gutter system.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIfyNxoKPPbOo7GR7fLTuQXUiOv1br34NEVF2gQNY8HhzRO4g=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Cortney Collo10 reviews · 6 photos",
          "rating": 5,
          "text": "We had a great experience with Joe and his staff! Everything was completed promptly and professionally. His installers showed up first thing, and worked very hard to finish the project within a few hours. Pricing was fair. I would highly recommend this company!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIv7xPxk6Dc_Mre7On5Cl3ajD9TLfSpQSPOZ5TrfWTNpoX4zTk=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Angelle Cresswell7 reviews · 4 photos",
          "rating": 5,
          "text": "Joe and his team came out and installed my gutters and leaf guards in one day. The gutters truly transformed my house. I absolutely love the quality as well as the look. Landon was very knowledgeable and professional, and the team took their time answering all of my questions! Joe's Gutters exceeded my expectations! Would highly recommend!!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVx3st_inhvczOYWtywmI8DXhXbU0JwBAoPA2rhi-f4O2WO35hdoQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Kyle Carver11 reviews",
          "rating": 5,
          "text": "Derel with Joe's Gutters was more than helpful in the process of repairing my gutters. He listened to my concerns, explained the process and executed my vision. The efficient communication and timely turn around is what makes this company top notch over others. I will recommend to friends and colleagues.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWEdBm_I4qNrUvHEyQ5JP0ge6-eLJZ6uWlg_yutF6b_yiee2hfL=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "K B3 reviews · 4 photos",
          "rating": 5,
          "text": "Incredible job! I love my beautiful new gutters! Super fast service and very easy to communicate with.  The BOSS was actually on the job site as well.  Great company! Would hire again!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKqEvJIsqjY-_6ENVZujXjfbpdbOU03r6b71sgTKvMlKwFusA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Vinh LamLocal Guide · 25 reviews",
          "rating": 5,
          "text": "Derel was extremely communicative and helpful during the planning and schedule process! Landon and Diego did a great job install the gutters! Additionally, they made sure to spend the extra time to clean up afterwards.\n\nI would definitely Joes Gutters if anyone was needing gutters.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7pYZrv3mhgfQ4oGqRTqnvcQNIBh6OSpU12dP-hHBrmjb7YHLTIw=w36-h36-p-rp-mo-ba2-br100"
        },
        {
          "author_name": "Sabrina Hernandez4 reviews",
          "rating": 5,
          "text": "Derel and the team are great. He came out to price the job quickly, and completed the service even faster! They cleaned up and did everything they said they would in no time. Derel even came to my house on a Saturday so we could see color samples, overall great experience and have already referred several family members. Thanks for everything!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUoW9WAvbtXBJHbylXxULCS1KpOruEwxy_lcQqdvrpkU-IQ0UJP=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "NIKI DITCHARO1 review · 3 photos",
          "rating": 5,
          "text": "Awesome job. Friendly customer service. 10/10 recommend",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5hicpVId-_kXL670PcEXKB9pVQfZgPhkfsHb8VUsiMv84DBU=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Jacob Porche7 reviews",
          "rating": 5,
          "text": "A ton of color choices, extremely professional, quick scheduling, and the install was definitely faster than I expected it to be. Overall the gutters came out great and we are very happy with our investment.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKeAcc7AIb9uR0WrUDGPAAJcAc6tH4VVzJ8gSQwOXhfuTjbWg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Daniel Vichot2 reviews · 3 photos",
          "rating": 5,
          "text": "Derel and his crew at Joe’s did a wonderful job repairing my home after we had tornado damage. They installed a new roof, new gutters, new fence, exterior painting and even took care of minor repairs that I could find noone else to do. They were professional and hard-working. They were prompt and reliable. Derel was regularly on site supervising and we were always in communication via text. It was a refreshing experience to work with Derel and Joe’s Gutters. Highly recommend!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbjYEpNcrrjvMPc2umGZZ7VHDCas5bS6W1zWqM8DPPQYCJfA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Andrea Dantin2 reviews · 2 photos",
          "rating": 5,
          "text": "Would give them more stars if I could !!  From start to finish of the process of installing all new gutters and patio they were amazing . Mr Joe and Deryl are always available and with quick response time . Installers were respectful and work spaces left immaculate when finished . I will be recommending them to everyone !!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIbFyMBv5RPY1EFjwDrUTt_poe9RByHuPzJR2g4j1mbgQtqrA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Matthew Melder3 reviews · 1 photo",
          "rating": 5,
          "text": "They did a great job! Exceeded our expectations, super fast and installed nicely and clean, while being affordable. We also love the color. It enhanced the exterior of our home. Definitely recommend. 10/10!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJZWzkhRTtK0x8iqdfzGcejHVi22T_6NZYfPhfTxhkf6ewMxCg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Miriam Crespo5 reviews · 2 photos",
          "rating": 5,
          "text": "Working with Joe’s made everything so easy. They were very responsive. I have a busy work schedule and they worked with me to get the job done. They did it earlier than anticipated. They left everything clean, worked in timely, manner and it looks great. I look forward to sitting out there and enjoying my patio.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJm1e8hd_H6YJUHWCXyskVxsO-9WVEI5KOD3iYLFKPJTE0U8A=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Robbie7 reviews · 1 photo",
          "rating": 5,
          "text": "Professionals  through out the entire job from estimate to completion of work.Prompt communications, Quality work.Dwayne and Landon were available to answer any questions. Thanks.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLYLbApvTstYxvTk8e6zS5q-Xs6xWBqZqxdfF8dNY4O3qQ8wA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Eric Butler3 reviews · 1 photo",
          "rating": 5,
          "text": "Joe's Gutters & Patios exceeded my expectations with their quality work and affordable pricing. Derel and his crew were fantastic to work with - professional, courteous, and highly skilled. They installed a screened-in patio at my home, and the result is nothing short of outstanding.  The attention to detail and craftsmanship are evident in every aspect of the construction. From my initial consultation with Joe to the final touches, the team was communicative, efficient, and dedicated to delivering the best possible project.  Highly recommend Joe's Patios & Gutters for anyone looking to enhance their outdoor space with top-notch work!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocILTcr7aj4Veesy8pQaUKdDc4TWuIqM_H_-EnoF2sGj2_7wwQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Carolyn Coffey4 reviews",
          "rating": 5,
          "text": "I am very happy with Joe's Gutters. They did just what we discussed and left everything neat and clean. After the rain, the usually muddy areas were dry thanks to the well installed gutters and downspouts. I recommend Joe's Gutters & Patios. Thank you.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRBvePfpgQw7_pWiL__P5F55PO3OALrqEzh60Wwx4snEqsww=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Lorna Bettisworth4 reviews · 1 photo",
          "rating": 5,
          "text": "Joe's Gutters and Patios did a wonderful job with putting up a new patio covering for us.   They were really quick too... less than 3 hours and they had it all done and cleaned up very well afterwards too.   I would highly recommend them.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJon-SdQ4nUQwdJFW7wiC7jDWnRVg1G64--H9dPSfgSZ9YNYQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Derris Armstead6 reviews · 2 photos",
          "rating": 5,
          "text": "Joes Gutters & Patios did an exceptional job on our home. I was very pleased with their professionalism and speed with the completion of the job. I definitely recommend them for anyone who is looking to get their gutters done.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1Dke2hP5Qz-5fUFP-ZQI2IIJedfZrDMJcJtZeXXGYO2tYIQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Georgette Laviolette2 reviews",
          "rating": 5,
          "text": "Mr.Joe came out to give us a estimate on a new patio cover.  I tell you,  he is so knowledgeable! That only comes with years of experience!! He didn't try to sell me something we didn't want and explained the whole process. The installation was efficient, they were done within a few hours! The price was much lower then the competitors. Thank you Mr.Joe !!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLUrijbupAAnDc9-GW_hgKleFZZTfyi9kDh3-xeewTugcQO1A=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "John Holwell4 reviews",
          "rating": 5,
          "text": "Excellent service.  Needed ~70 feet of gutters replaced after a wind storm.  The crew worked well together and quickly installed the gutters and four downspouts.\n\nWould highly recommended.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2v4IayQVTeaPloAlJ_Tc3vbgNbaNitvp72YjAkF4XieXtaw=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Yvonne Leger1 review",
          "rating": 5,
          "text": "The crew showed up on time and finished installing our patio cover quickly. Everyone was very professional. All of my questions were answered. Very pleased.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK9A-Uopk5xQ3WU-q9Ng2KkBLgDkPOad5sNsbzde8ioFJLmvQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Denise J. Spencer5 reviews",
          "rating": 5,
          "text": "Excellent Service, courteous, friendly, professional, and helpful and resonable price. My experience was pleasant from beginning to end. I definitely highly recommend this company.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXXLRt6RT5hIuP5dhDfsGoRRCr4DFjRdu99kjxZHd0QA_R7L7cgA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Truong Nguyen9 reviews · 4 photos",
          "rating": 5,
          "text": "Joes Gutters & Patios,L.L.C is the best decision I ever made.. they are family own local to new orleans. Very Professional. Service was beyond my expectation!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVLuj9EvUm_4HXMkuAIWmRiv9sCBBG3L1SGYkdw-xVIFpzwXg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Adriel Folse3 reviews",
          "rating": 5,
          "text": "Great people to get the job done and very quick. My gutters and patio look great. I recommend them to everyone. They did a great job!!!!❤️",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9BXYBywHCXWZjfeBgaxV5_R-peQtuskQJbB3m6wRQeFYl0Co=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Robert Hallas1 review",
          "rating": 5,
          "text": "Gutter had had pulled away from fascia. Old Ida damage. Guy did fine job, gutter is straight and drained well during a short afternoon thunderstorm.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLF6mdBRLRCWYWMHyf6QNyZGLje_2zqg6maRtJzWDbxSH6xSg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Chanda Guchereau10 reviews · 2 photos",
          "rating": 5,
          "text": "I instant message Joe, he replied quickly He came to my house that afternoon got a quote this was a Friday. Monday morning he let me know they would be here for Tuesday 8am. They guys came replaced 8 panels and the front panel (pretty piece)\nOther companies wanted to replace the whole thing 52' long even the company that installed patio. Others wanted too much to fix it, but Joe's gutters & patios good price and fast service!! I would use them again!!\nHappy Customer\nChanda Guchereau\nKenner",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLu2CUIIMu_GLmvx4XsW-_bY_VshvGxYuAkJrZoS44uApd17g=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Jerry Potts11 reviews · 1 photo",
          "rating": 5,
          "text": "Competitive pricing, quality products and quality installation.  A bi plus, they did not keep finding \"other issues\" to address after their estimate.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIMAHsacyZ-lAP-N_124XgwRcn1FF-mTiFcGXsVB32O_1YOLQ=w36-h36-p-rp-mo-br100"
        }
      ],
      "rating": 5,
      "user_ratings_total": 215
    },
    "timestamp": 1749971105439
  },
  "https://www.google.com/maps/place/Sparkle+Carpet+Cleaner+%26+Upholstery+Cleaner+Sevenoaks+Kent/@51.0975769,0.356293,11.5z/data=!4m18!1m9!3m8!1s0x6dfbe1fef99a894b:0x86b04270f1bc5185!2sSparkle+Carpet+Cleaner+%26+Upholstery+Cleaner+Sevenoaks+Kent!8m2!3d51.1014698!4d0.2460255!9m1!1b1!16s%2Fg%2F11y5k2vdpw!3m7!1s0x6dfbe1fef99a894b:0x86b04270f1bc5185!8m2!3d51.1014698!4d0.2460255!9m1!1b1!16s%2Fg%2F11y5k2vdpw?hl=en-US&entry=ttu&g_ep=EgoyMDI1MDYxMS4wIKXMDSoASAFQAw%3D%3D": {
    "data": {
      "reviews": [
        {
          "author_name": "Alison BarnesLocal Guide · 7 reviews · 24 photos",
          "rating": 5,
          "text": "Sparkle cleaned our stair carpet and 3-piece suite and they did a fabulous job - the furniture came up almost as good as new and far better than I was expecting. They were very efficient and punctual and I thoroughly recommend them!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItcCUUq9d9oKDYGuwk18uu-tLI11yRwd_dg93b8KGRlC7vog=w36-h36-p-rp-mo-ba2-br100"
        },
        {
          "author_name": "Worldofbeauty Uk2 reviews",
          "rating": 5,
          "text": "I recently used their carpet cleaning service and couldn't be happier. The team was punctual, professional, and left my carpets looking brand new. Stains I thought were permanent vanished, and the entire house feels fresher. Excellent service, highly recommend! Five stars!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV1pMG5S_C1wWTXHXQuozenzaNelyl_Yc8gy99wI7IgDO1YS0qA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Peter Chidgey6 reviews",
          "rating": 5,
          "text": "Thank you to Sparkle Carpet Cleaner company , they did a wonderful job on my bedroom carpets , they now look brand new !\nThe crew that attended were very efficient and polite and cleaned up after they finished the work , credit to the company\nKind regards Peter",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocINtfNCeWxBwgqEUnhDKwaXyTZWeJIN-X0ZfRc3qzKtnV3f-A=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Cody Seymour18 reviews · 8 photos",
          "rating": 5,
          "text": "I met the owners and was so impressed by the care for their craft! Had no idea how clean my carpet could get!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ352Sibk__esE5WEtqF0GxWzubpA2ppGyrfEG5cpfCNCwlzA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Rebecca Herbert3 reviews",
          "rating": 5,
          "text": "Such a friendly, efficient, professional team of people! Couldn't ask for more! Nothing is too much trouble and the end results were even better than I expected! Would not hesitate to recommend to anyone!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIxvI3ohPta8iE5NTyS8aMareoWFQI1Ty1amaJ1liaFpJ7Jfg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Leah Chalmers Monterroso2 reviews",
          "rating": 5,
          "text": "We had our sofa, rugs and all carpet cleaned recently. The guys were polite, clean and everything looks great. Thanks!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUmbDTe_aRWXYNJbuIkKb9e8QnfHftv-nRGdaIkn1OAVpf-bzc=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Kieren2 reviews",
          "rating": 5,
          "text": "Very friendly and professional team! I’d highly recommend them to anyone wanting an efficient and high quality result!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIx_bOn44Js8LeR5MT9CV8xD74Lwj-aH6OgOFFsDxld_KM4vQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Stephanie JonesLocal Guide · 20 reviews · 1 photo",
          "rating": 5,
          "text": "Love these guys! Always so friendly and efficient and do a really thorough job.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIg47r4vbfMsvyfjdKNnTclxxGdjaRBoyMzEQuCDmlFXiOzdQ=w36-h36-p-rp-mo-ba2-br100"
        },
        {
          "author_name": "Lili Szabo2 reviews",
          "rating": 5,
          "text": "These guys are amazing at what they do and fully  accomplish the final product!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGphNCFesYwmXqhWtkX8aK-EK--mS1Q8zvT7tlMDH9MerdkGc=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Manuela Wąs1 review",
          "rating": 5,
          "text": "Thanks a lot",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKqOw7f1DFG1E2AC5cF9NuBgmZh5I0k8LZZQFVhmhjwvFowSA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Katlin Valena2 reviews",
          "rating": 5,
          "text": "Thank you very much",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWRJCqzzQB3yuzA6x8ZH8w1LaTH5ksfXC3IEfaRvRnQp8T-TsBm=w36-h36-p-rp-mo-br100"
        }
      ],
      "rating": 5,
      "user_ratings_total": 11
    },
    "timestamp": 1749972247880
  },
  "https://www.google.com/maps/place/Timothy+%26+Co./@45.5944661,-95.9178106,4641m/data=!3m1!1e3!4m8!3m7!1s0x52ca6f5842968fff:0x618c7a55dfdc772e!8m2!3d45.5944661!4d-95.9178106!9m1!1b1!16s%2Fg%2F1td5qx_7!5m1!1e1?entry=ttu&g_ep=EgoyMDI1MDYxMS4wIKXMDSoASAFQAw%3D%3D": {
    "data": {
      "reviews": [
        {
          "author_name": "Dorothy KramerLocal Guide · 11 reviews",
          "rating": 5,
          "text": "I couldn’t be happier with the service I received from Chris at Timothy & Co. From start to finish, he was professional, prompt, and incredibly thorough. My carpets look absolutely amazing, fresh, clean, and like new again!\n\nWhat truly set this experience apart was the excellent advice Chris gave on how to maintain my carpets using my everyday cleaner.\n\nHis tips were simple, practical, and incredibly helpful, and it’s already making a difference in how my carpets look between cleanings.\n\nThank you, Chris, for your top-notch service and for going above and beyond. We will definitely be using your company again and recommending you to everyone we know!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU06lvmPkAjQyAfjfKnicpcZI-VpXj1Uod6iZGT0icMTSazQEU1FA=w36-h36-p-rp-mo-ba2-br100"
        },
        {
          "author_name": "Kelsey Ringsaker6 reviews · 13 photos",
          "rating": 5,
          "text": "My car was cleaner than when I got it brand new! Very happy and impressed. We have 2 dogs that shed and 2 messy children. Thanks Timothy and Co! Very happy I signed up for the club!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIr90-OK6SyvX_KlKMpj_UV7WzEaOZ24ssX7SE8n9mGgS6qCQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Kelly ThompsonLocal Guide · 19 reviews · 7 photos",
          "rating": 5,
          "text": "Very professional great communication I can express how great this company is and their professionalism they came in no questions asked cleaned and shampooed. My dad‘s carpets priced very reasonably will definitely use again in the future.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWcgpy2CfPyG5wdp6798QH4wF1P9iHTzqFAVwOL_NlWSnaQaNkm_g=w36-h36-p-rp-mo-ba3-br100"
        },
        {
          "author_name": "Megan Schroeder11 reviews · 4 photos",
          "rating": 5,
          "text": "Chris cleaned our office and got out oil/grease stains I didn't think were going anywhere! Great job and so nice to work with.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKVrPO5p0u8ckTlKEqF_5OgzUUW4FeHh-DHL7aA7fdr0YLG3w=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Hope Community Church Minnewaska Area1 review",
          "rating": 5,
          "text": "We always use Timothy's for our carpet cleaning.  They are fast in responding and we can count on them to show up and do an excellent job every time!  I would recommend Timothy's.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVLrGHbeZ1y242tFI50qkmua9Ts1U81pXrVPTeAZ1xgnt4WTf2d=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Dani Mathison8 reviews · 2 photos",
          "rating": 5,
          "text": "This is the second time I’ve had Timothy & Co. clean carpets and both times have been phenomenal !  So easy to work with from answers questions to scheduling to the actual job.  I can’t say enough good things about Chris and this company!!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXT8sHSD04rU_l4UmrylzH8xPNYoiHLQQrAQ6g4vyWmfbNgymrq=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Laurel SeibelLocal Guide · 11 reviews",
          "rating": 5,
          "text": "Great friendly service. Carpets looks very nice. Thanks for your service.  I thought it was a pretty reasonable price as well. A BIG thank you.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZD6LeS9_1WERiJSqDIEYH0uQH6mGk8sDxHlCxlvMkX8znkg=w36-h36-p-rp-mo-ba2-br100"
        },
        {
          "author_name": "Sam CnossenLocal Guide · 92 reviews · 89 photos",
          "rating": 5,
          "text": "This guy right here! On time! Communicates!!! Did a great job on all my floors!!!!! Tile, wood composite kinda like hardwood, and carpets.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXTHw0q0euWnvI1buziqtf24S1pywKZRfXo6JuMA7BWMbJR9ief=w36-h36-p-rp-mo-ba4-br100"
        },
        {
          "author_name": "Cait CLocal Guide · 7 reviews · 4 photos",
          "rating": 5,
          "text": "Our jeep hadn't been deep cleaned for years and now it looks brand new! I will definitely be using their services again!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVmSHWOyUvColSmHTMhFIT5Oa43u6j-Hy9EFKaz9c2qxvfwz1Nr=w36-h36-p-rp-mo-ba3-br100"
        },
        {
          "author_name": "Christine Schmidt1 review",
          "rating": 5,
          "text": "Very professional and efficient.  Had some difficult stains and were happy with the results of the carpet cleaning.  Would use this company again.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJiFn4CPcNqJJ5KHHhj8nNaV88LwZvLrxMkxIpLJAn5-CQsQA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Carrie2 reviews",
          "rating": 5,
          "text": "Chris was great to work with from the beginning! He was prompt in answering my email & setting the appointment. He was on time the day of & was very respectful. Great service & will definitely hire him in the future!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLGZG1tejNhrhuH6rrQNhs-6Jyu1E0qydsz2vMsCLqIVRvA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Vickie Brustuen2 reviews · 2 photos",
          "rating": 5,
          "text": "They were very prompt in getting to our house. They were done in a couple hours and the carpets looked great!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJJcmpHDhvTayiwv0aVXVa2Bns73YgQesx356gnMmrnZ81G4Q=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Ellen Beckius2 reviews",
          "rating": 5,
          "text": "I waited until almost the last minute to schedule carpet cleaning for my apartment, but Chris was so accommodating and got me set up with a time. They were super fast and did a super great job. I don’t leave reviews often, if ever, but they did a really wonderful job and I highly recommend them!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI1JdwFdj153pdvynSFct-k5JDmbc6aS46Hw19jii8t34RGsw=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Linda Dahl2 reviews",
          "rating": 5,
          "text": "Our tile looks better than it ever has and very satisfied with his work.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL5Oxd9Dyd4yWqk01efNsveXekxJFAZSuP-TxN6iH3aWPPvDg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Asha Bezanson5 reviews · 3 photos",
          "rating": 5,
          "text": "Timothy & Co. did a killer job cleaning up the interior of our new-to-us work vehicle! Chris and his crew had our vehicle squared-away, smelling and feeling like brand new. We look forward to scheduling an exterior service from them soon!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8IzXcxYb9jltbrF5PYIPeYEuZNTtcZjUfr-B2225neNsGQg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Vivian Heltemes1 review",
          "rating": 5,
          "text": "Very professional. Careful, clean, and courteous. Explained things well. Easy to work with. Would highly recommend.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLmWf_3ZxQAEAkuOOTXFQzBRKcCTGD9wCAuRGxuWLDqw9ZkGg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Jodi Holleman1 review",
          "rating": 5,
          "text": "They cleaned a White Couch and Chair and the carpet - everything looks brand new!!!  Excellent Job!!!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLrddkQK1SFrGZbCswYDomhLW7-4cORTASXgrVmPuURbZ3vHg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Samantha Rau6 reviews · 1 photo",
          "rating": 5,
          "text": "Great job!! Even picked up and dropped off my car!!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVLKt_J4nq_ahf31hvMYqWCl2HzbKhVUWU4mEZ7RgQpjTRmmIcv=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Tammy Dierks1 review",
          "rating": 5,
          "text": "Chris is very professional and he does an awesome job. Our carpets looked wonderful when he was done! I highly recommend Timothy & Co for carpet cleaning.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV64TpfsJvee_-wRxXu-2q_2FYSWANw-Pptwht6zeqrkSSWbOW6=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Tessa Hansen10 reviews · 19 photos",
          "rating": 5,
          "text": "I had a tenant that had a dog that apparently was Not very often let outside to go to the bathroom and he warned  me up front it might not be a good outcome because they were so saturated with urine.  He did a great job and it has been a couple days and still smells so much better.  And looks great as well.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIlCszX4Nn7j1rSzbLpZO5HQc5Z0aqzdCPsW4ZFP-f6kIOanQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Renee Schwebach1 review",
          "rating": 5,
          "text": "Friendly. Courteous. Careful. Timely. My couch looks like new, as does my carpeted stairs! Very pleased with a job well done. Thank you, Chris and Josh!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIUsRknEEftSC7KNMRwXgzUub6tXYKJfR3g3G6xYJRbaF4diQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Jean Dahl1 review",
          "rating": 5,
          "text": "We have been having Timothy & Co clean our carpets for many years and they always do such a great job. They are prompt and courteous and our carpets always look amazing when they are done. Chris is awesome and we love helping a small town family business!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCp3bQKHOrSni-E4kqIo92uGVYZn9L57hPf0xMlfvK78h5lA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Kelly Claassen4 reviews · 5 photos",
          "rating": 5,
          "text": "All of the carpets look great. Chris is very professional from the initial call,  the creative messages and very prompt service. We couldn't have asked for anything better.  We will definitely use his services as needed in the future and will always recommend him when given the opportunity.  Thank you so much Chris!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVTBLIq9QJbeRXY6dci-oIywwgM31Ug5BM4HV1wXi8CWkbVPxqV=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Jill Steiner8 reviews",
          "rating": 5,
          "text": "Chris was very professional and easy to work with. The carpets in the basement hadn't been cleaned for 9 years. They look so clean, feel soft, and smell great!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWKst8QpzehJoKOgXBBm888Ucxou7mrtzveF915jY609xDEvkWlUA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Karin Weigel9 reviews",
          "rating": 5,
          "text": "Chris was professional, kind, clear and wicked fast! Our carpets were DIRTY! I am throughly shocked at how clean they are now! They look and smell amazing! We would recommend his services to anyone and we will certainly tell all of our friends! Thank you so much! What a wonderful experience from start to finish!\n~The Weigel Family",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWKGPl9CdeJT1pgwuFlsO0N7OEAuGEOOJHZ_kZHEr5CpuhWgb_3wg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Adriana Yackel2 reviews",
          "rating": 5,
          "text": "Highly recommend Timothy & Co. Inc.\nVery easy to schedule with, very professional. He did an amazing job with our sectional, looks good as new. Will definitely recommend to friends and family.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocISQ8r0E5H_B7N61LAZSWoRO3FdJ3iVGA3mD-miomkflxeKDv4=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Kuehne Wall8 reviews",
          "rating": 5,
          "text": "Best carpet and rug cleaning service this side of Mandan.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKmDEe9Lf2KfI-vPVl75_txxRyqnAe81sPmAweutcvD7P3BdA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Josh SummerLocal Guide · 12 reviews · 3 photos",
          "rating": 5,
          "text": "We are very impressed with how nice our carpet in our house is again. We were about to replace it as it was stained and worn out. Chris was able to bring it back to almost new and we couldn't be happier. Thank you Chris.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLdFHiAyHVzxeJ6TZ_ZJEghOXfekBeFaC2NSVULyXe-H1yIfQ=w36-h36-p-rp-mo-ba2-br100"
        },
        {
          "author_name": "Constance Boeckmann2 reviews",
          "rating": 5,
          "text": "Amazing results.  Never thought the high traffic areas on this 15 yr plus old carpeting could come so clean! Thanks Chris.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCIu8cESngOJPutTvr73PAXrBPhS3l4eqlrFeHAZ6qoxlGhQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Ashley Melberg2 reviews",
          "rating": 5,
          "text": "Very prompt. Thank you for making the place look 1000 % better.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLmlXA-xyM-04cWZCtbvcVCVW82HPl2g4lekqSaIaMdIVM6pg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Melissa Walerius6 reviews",
          "rating": 5,
          "text": "I needed a major carpet refresh and that's exactly what I got, but paired with top quality customer service!\n\nI appreciated the thorough walk through of the state of my carpet and the various options they provide and recommended my carpet specifically. Chris and his team are top notch!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXXlYYD_-VoEUbinal2Kuf7X7pF4JR-Tk8KTjqWPfOD5UdMvllL=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Crystal Thielke7 reviews",
          "rating": 5,
          "text": "Timothy & Co. did an amazing job! Very thorough and efficient. Extremely professional. Our carpets looked amazing after! It seriously brought life back to them. Each and every time they come is such a great experience. Our latest service from them was air duct and vent cleaning. Wow! They did such a great job! They had their work cut out for them and they rocked it out!\n\nYou will be so happy you found them to take care of your home.\n\nThank you so much Chris & team!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfIyfT0rVa68X1XLTTDXQcmsn6uUJp7luEEbdf9eWY7wN7bJBp=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Danielle Anderson3 reviews",
          "rating": 5,
          "text": "I had Chris from Timothy's detail our family vehicle, and he did an incredible job. Not 1 speck of dust or crumb was left behind! Thanks for restoring my vehicle back to the original condition in which I bought it. Chris was very flexible and accommodating.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLvLKmnaO-nD_KSPuaAwJt7LHXrJ392TJUHwHJDlmjjGhdOjg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Vicki Asmus1 review",
          "rating": 5,
          "text": "Chris and his partner were amazing and I can’t tell you how unbelievably clean my carpet looks, feels and smell.  They had a real challenge too.  My carpet was filthy!!  I highly recommend them!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLvNDczp8iCIsnK4wGlJoV5YbJIWipWettYLMkkwpQOduTT8A=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Brian Behrens1 review",
          "rating": 5,
          "text": "Chris was great to work with.  He responded to my emails and calls right away.  He was flexible and very patient.  Did a great job on the carpet and sofa.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJTojw-RPJ4ToUYEoWkHzp2nfOACc4Nc_kNFLFloSdBMTe8Ew=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Danille Mathison6 reviews",
          "rating": 5,
          "text": "I called Timothy & Co. on Monday and was able to get an appointment for Thursday.  Chris and Danny were the ultimate professionals!  They explained the entire process and went to work on cleaning a carpet that was in pretty tough shape.  And, it looks amazing!  I couldn’t be more pleased with how it turned out.  I also am so so happy with the customer service - responsive, prompt, kind.  The whole experience was 5 star!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWwFumt39Oov47g03qlMsAnuXyGkkxDWno_tVO9fgibOThkbIMsNg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Glennie Olson11 reviews",
          "rating": 5,
          "text": "Tim and Logan detailed my pontoon while it was stationary on the lift. They did an awesome job. I so appreciate their flexibility and effort.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXK4PgDEnka6LrZRH0K7oh2UriSwAyICQS0gGsE4qQs4IrrPyYlWw=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Mary Robertson1 review",
          "rating": 5,
          "text": "Timothy’s did a fabulous job on my carpet, it looks like new. I will recommend him to everyone",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK4GrcJx0DhHRz3gzemt_QeyMdb35YeA-UpP00wpyUYmlZajA=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Brenda Sargent2 reviews",
          "rating": 5,
          "text": "I knew Chris does a magnificent job, but we provided him with more of a challenge this time. We own a dog now!!\nHe didn’t disappoint. The dog smell in our family room is gone and the carpets look great!\nBrenda",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJQgq7jk-4tWKYYM1ES77OOm6SOI1l3wTwraJhbvo59fbKSCw=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Melanie Fohl3 reviews",
          "rating": 4,
          "text": "He was very efficient and our carpet looks great! He provided a quote before starting and was very affordable.  Wish he had a crew to do furniture moving.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWhzVBDG51qBYCfoDgGnIzNDfnNnIjS-8jkOFhPf0JN0KzRzvMn=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Summer Anderson1 review",
          "rating": 5,
          "text": "We had Timothy & Co clean our living room carpets. They offered professional customer service, quality work, and extreme attention to detail. We will schedule a car detail with them next!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKH47sOyEoj8gOcpK85kj6TOWWRpeFh9ywp8f2eBaCLksxAhg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Sarah Graham2 reviews",
          "rating": 5,
          "text": "Talk about a great friendly company that worked in my budget and did a great job. Just purchased a new home that needs quite a bit of repair and needed the carpets to be sanitary for our kiddo to play on. We closed at 1pm on a Thursday and Timothy & Co was at the house ready to work at 2pm!!!! Would highly recommend. Fast, Convenient, great pricing and Friendly.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJmdhhyZ_QqK9DG84plg7oxak5cvz_PHFCoThB8Ztx9HgA-W6s=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Ragen Bristol4 reviews",
          "rating": 5,
          "text": "Great job!  The floors turned out amazing!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVbd8KI9da7qQOnFPztG8xc9csDhqVC2u_TqDjQudeY4MBUCKb4=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Connie Sell3 reviews",
          "rating": 5,
          "text": "A while back I had this company clean carpets, which included considerable stain removal.  I was very pleased.  Most recently they cleaned the ducts & vents, and I was not disappointed.  They are very polite & respectful, plus work hard and clean up after themselves.  I definitely recommend them.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKHhft3NGPLcsi8SqHPacV6lYThUPoy-wnCPa1pCUtCpDU2Ug=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Laurie Trainor1 review · 4 photos",
          "rating": 5,
          "text": "These guys always do a great job. Prompt, thorough and very good overall. I would highly recommend. I've had both my house and business carpets cleaned and been very satisfied.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLaTHdHS15I1wfJmyVK_eeYSOc4bd2ngUUd6X8nCwIN36yVeg=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Kristina Zempel7 reviews · 2 photos",
          "rating": 5,
          "text": "Thanks for everything.  It looks amazing! Here is the before and after pictures!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKDQO5ydM976HXZtraA2EDC6o1Jeaf_wEpKN2yXci0gtvd01w=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Chase Mastel7 reviews · 1 photo",
          "rating": 5,
          "text": "Had this great guy show up and he took all steps to ensure our concerns were acknowledged and our expectations were met. From protecting our corners and walls, to door flaps to keep the heat in. He was incredibly professional and took his time to do the job right. From what I could tell he had top notch equipment. Our carpets have been abused by small kids and two dogs. They don’t look like it anymore. 100% would hire again. Having them come back to do our ducts very soon.\n\nThanks for the great work Chris!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0wZ3egPYJLs4t2vU_FSUEDP2Asp5inum36NHgsg7oUrHbT2Ky=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Jocelyn Schowalter1 review",
          "rating": 5,
          "text": "Chris is extremely professional and friendly. Our carpets look brand new.  I would definitely recommend his carpet cleaning service.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIEWcy2euAicxWwlY8xD30nUql-fUz6vsQeVY4DuWPd_LhlmQ=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "Missy Logan5 reviews",
          "rating": 5,
          "text": "Chris did an AWESOME job on our RAM!  It was an absolute disaster inside!  We would definitely recommend Timothy & Co to everyone!",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLSyGK74qD__PyQZo06xT8bZHmqHghP41dSr39Y7glGzYYx_Q=w36-h36-p-rp-mo-br100"
        },
        {
          "author_name": "James Walburg2 reviews",
          "rating": 5,
          "text": "We have had Timothy’s clean our carpets and upholstery for the last couple of years. He has always done a super job and quite reasonable.\nWe just had our carpets and a couple of throw rugs along with upholstered dining room chairs\nCleaned. They look like new! I would highly recommend.",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKf7FgkiD1XaFmZ-MRwjAJFbpRZipAB3JjM9sSIZICDqcylWw=w36-h36-p-rp-mo-br100"
        }
      ],
      "rating": 5,
      "user_ratings_total": 202
    },
    "timestamp": 1750091744834
  }
}